Revit 2027 API
BuiltInFailures.SketchFailures.NestedLoops Property
 Cannot have nested loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NestedLoops { get; }
Public Shared ReadOnly Property NestedLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NestedLoops {
	FailureDefinitionId^ get ();
}
static member NestedLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace